from fastapi import FastAPI, Request
import hashlib, hmac, base64, json
from fastapi.responses import PlainTextResponse
import requests
from typing import Optional
import random



app = FastAPI()
OPENROUTER_KEY = os.getenv("OPENROUTER_API_KEY")
  
async def call_gamma(prompt, user_input, temperature):
    url = "https://openrouter.ai/api/v1/completions"
    headers = {
        "Authorization": f"Bearer {OPENROUTER_KEY}",
        "Content-Type": "application/json"
    }
    dprompt = f"""
    {prompt}
    {user_input}
    """
    payload = {
        "model": "google/gemma-3-4b-it:free",
        "prompt": dprompt,
        "temperature": temperature,
        "max_tokens": 1000
    }

    response = requests.post(url, json=payload, headers=headers,timeout=60)
    result = response.json()['choices'][0]['text'].strip()
    return result

  
p1_1="""The Fool หมายถึง การเริ่มต้นอะไรใหม่ ๆ การเสี่ยงอันตราย หากว่าเปิดได้ไพ่ใบนี้แล้วล่ะก็ เส้นทางใหม่ที่เพื่อน ๆ จะเดินไปอาจมีความเสี่ยง แต่เป็นความเสี่ยงที่เพื่อน ๆ ต้องการ รู้ว่าเสี่ยงแต่คงต้องขอลอง"""
p1_2="""ไพ่กลับหัวของ The Fool ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ หมายถึง การเริ่มต้นอะไรใหม่ ๆ การเสี่ยงอันตราย หากว่าเปิดได้ไพ่ใบนี้แล้วล่ะก็ เส้นทางใหม่ที่เพื่อน ๆ จะเดินไปอาจมีความเสี่ยง แต่เป็นความเสี่ยงที่เพื่อน ๆ ต้องการ รู้ว่าเสี่ยงแต่คงต้องขอลอง"""
p2_1="""ไพ่กลับหัวของ The Magician  ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ หมายถึง ความทะเยอทะยาน การลงมือทำ ไพ่บอกว่าเพื่อน ๆ เก่งมาก อยากทำอะไรก็ลุยให้เต็มที่เลย เพราะไฟในตัวมีเยอะพอ ๆ กับความสามารถ ดังนั้นลุยได้เลยไม่ต้องยั้ง"""
p2_2="""The Magician หมายถึง ความทะเยอทะยาน การลงมือทำ ไพ่บอกว่าเพื่อน ๆ เก่งมาก อยากทำอะไรก็ลุยให้เต็มที่เลย เพราะไฟในตัวมีเยอะพอ ๆ กับความสามารถ ดังนั้นลุยได้เลยไม่ต้องยั้ง"""
p3_1="""The High Priestess หมายถึง ความฉลาด มีความรู้ความสามารถ เป็นตัวแทนของคนเก่งมากความสามารถ แต่มักซ่อนสิ่งนั้นเอาไว้ภายในรูปลักษณ์นิ่งเงียบที่แสดงให้ภายนอกได้เห็น 
"""
p3_2="""ไพ่กลับหัวของ The High Priestess ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ หมายถึง ความฉลาด มีความรู้ความสามารถ เป็นตัวแทนของคนเก่งมากความสามารถ แต่มักซ่อนสิ่งนั้นเอาไว้ภายในรูปลักษณ์นิ่งเงียบที่แสดงให้ภายนอกได้เห็น 
"""
p4_1=""" The Empress  หมายถึง ความอุดมสมบูรณ์ ความเป็นแม่ เปิดได้ไพ่ใบนี้บอกเลยว่าจะเจอแต่ความสุขความสบาย เงินทองมั่งมี หรืออาจหมายถึงโอกาสตั้งครรภ์ได้ด้วย"""
p4_2="""ไพ่กลับหัวของ The Empress ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ  หมายถึง ความอุดมสมบูรณ์ ความเป็นแม่ เปิดได้ไพ่ใบนี้บอกเลยว่าจะเจอแต่ความสุขความสบาย เงินทองมั่งมี หรืออาจหมายถึงโอกาสตั้งครรภ์ได้ด้วย"""

p5_1=""" The Emperor หมายถึง การมีอำนาจ ชอบสั่ง และไม่ยอมใคร เพื่อน ๆ อาจอยู่ในสถานการณ์ที่ต้องยอมทำตามผู้ใหญ่ ถูกบังคับจากคนมีอำนาจมากกว่าก็เป็นได้ และยังหมายถึงความมั่นคงได้อีกด้วย """
p5_2="""ไพ่กลับหัวของ The Emperor ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ หมายถึง การมีอำนาจ ชอบสั่ง และไม่ยอมใคร เพื่อน ๆ อาจอยู่ในสถานการณ์ที่ต้องยอมทำตามผู้ใหญ่ ถูกบังคับจากคนมีอำนาจมากกว่าก็เป็นได้ และยังหมายถึงความมั่นคงได้อีกด้วย  """

p6_1="""The Hierophant  หมายถึง การมีความรู้ การแต่งงาน การรวมเป็นหนึ่ง พระคือตัวแทนของผู้มีความรู้และยังเป็นตัวแทนในการแต่งงานรวมเป็นครอบครัวเดียวกัน อาจหมายถึงการเป็นที่พึ่งพาของคนอื่น ๆ  """
p6_2="""ไพ่กลับหัวของ The Hierophant ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ  หมายถึง การมีความรู้ การแต่งงาน การรวมเป็นหนึ่ง พระคือตัวแทนของผู้มีความรู้และยังเป็นตัวแทนในการแต่งงานรวมเป็นครอบครัวเดียวกัน อาจหมายถึงการเป็นที่พึ่งพาของคนอื่น ๆ  """


p7_1=""" The Lovers  หมายถึง ความรัก การตัดสินใจ แน่นอนว่าใบนี้ต้องหมายถึงความรัก ได้พบเจอความรัก หรือต้องตัดสินใจเลือกสิ่งใดสิ่งหนึ่ง"""
p7_2="""ไพ่กลับหัวของ The Lovers ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ   หมายถึง ความรัก การตัดสินใจ แน่นอนว่าใบนี้ต้องหมายถึงความรัก ได้พบเจอความรัก หรือต้องตัดสินใจเลือกสิ่งใดสิ่งหนึ่ง"""


p8_1="""The Chariot   หมายถึง ความแน่วแน่ มุ่งมั่น ขยัน ทุ่มเท เมื่อเจอไพ่ใบนี้ เพื่อน ๆ ก็ต้องทำตัวให้แข็งแกร่งยิ่งกว่าม้าศึกถึงจะประสบความสำเร็จในสิ่งที่ทำ """
p8_2="""ไพ่กลับหัวของ The Chariot ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ   หมายถึง ความแน่วแน่ มุ่งมั่น ขยัน ทุ่มเท เมื่อเจอไพ่ใบนี้ เพื่อน ๆ ก็ต้องทำตัวให้แข็งแกร่งยิ่งกว่าม้าศึกถึงจะประสบความสำเร็จในสิ่งที่ทำ """


p9_1=""" Strength  หมายถึง ความแข็งแกร่ง บริหารจัดการเก่ง ไพ่นี้คือตัวแทนของหญิงสาวสุดแกร่ง มีอะไรเข้ามาก็ไม่อาจทำอะไรเธอได้ แถมยังจัดการสิ่งต่าง ๆ ได้เป็นอย่างดีอีกด้วย """
p9_2="""ไพ่กลับหัวของ Strength ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ   หมายถึง ความแข็งแกร่ง บริหารจัดการเก่ง ไพ่นี้คือตัวแทนของหญิงสาวสุดแกร่ง มีอะไรเข้ามาก็ไม่อาจทำอะไรเธอได้ แถมยังจัดการสิ่งต่าง ๆ ได้เป็นอย่างดีอีกด้วย """


p10_1="""The Hermit   หมายถึง ความสันโดษ โดดเดี่ยว วิเคราะห์ เมื่อเจอไพ่ใบนี้ก็คงเลี่ยงไม่พ้นการอยู่ตัวคนเดียว การใช้เวลารักษาเยียวยาจิตใจ หรือแม้แต่การใช้เวลาเพื่อคิดวิเคราะห์สิ่งต่าง ๆ รอบตัว อย่าได้ใจร้อนทำสิ่งใดเด็ดขาด """
p10_2="""ไพ่กลับหัวของ  The Hermitความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ   หมายถึง ความสันโดษ โดดเดี่ยว วิเคราะห์ เมื่อเจอไพ่ใบนี้ก็คงเลี่ยงไม่พ้นการอยู่ตัวคนเดียว การใช้เวลารักษาเยียวยาจิตใจ หรือแม้แต่การใช้เวลาเพื่อคิดวิเคราะห์สิ่งต่าง ๆ รอบตัว อย่าได้ใจร้อนทำสิ่งใดเด็ดขาด """


p11_1=""" The Wheel of Fortune  หมายถึง โชคชะตา เปลี่ยนแปลง หากไพ่ใบนี้ปรากฏขึ้น เพื่อน ๆ ต้องเตรียมตัวให้ดี เพราะมีโอกาสเกิดเรื่องที่ไม่คาดฝันได้ มีการเปลี่ยนแปลงที่เราไม่อาจขัดขวางได้ อาจจะเป็นเรื่องดีหรือไม่ดีก็ได้เช่นกัน """
p11_2="""ไพ่กลับหัวของ The Wheel of Fortune ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ  หมายถึง โชคชะตา เปลี่ยนแปลง หากไพ่ใบนี้ปรากฏขึ้น เพื่อน ๆ ต้องเตรียมตัวให้ดี เพราะมีโอกาสเกิดเรื่องที่ไม่คาดฝันได้ มีการเปลี่ยนแปลงที่เราไม่อาจขัดขวางได้ อาจจะเป็นเรื่องดีหรือไม่ดีก็ได้เช่นกัน  """


p12_1=""" Justice หมายถึง การตัดสินใจ เท่าเทียม กฎหมาย หากเปิดเจอไพ่นี้แสดงว่าเพื่อน ๆ จะได้รับความยุติธรรม มีการตัดสินใจที่ก่อให้เกิดความเท่าเทียม หรืออาจจะเจอกับเรื่องราวเกี่ยวกับกฎหมายก็ได้เช่นกัน """
p12_2="""ไพ่กลับหัวของ Justice ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ  หมายถึง การตัดสินใจ เท่าเทียม กฎหมาย หากเปิดเจอไพ่นี้แสดงว่าเพื่อน ๆ จะได้รับความยุติธรรม มีการตัดสินใจที่ก่อให้เกิดความเท่าเทียม หรืออาจจะเจอกับเรื่องราวเกี่ยวกับกฎหมายก็ได้เช่นกัน """


p13_1=""" The Hanged Man หมายถึง การรอคอย เสียสละ เพื่อน ๆ อาจได้เจอกับสถานการณ์ที่ไม่อาจตัดสินใจทำอะไรได้ ต้องอยู่นิ่ง ๆ ต้องรอคอย หรืออาจจะต้องเสียสละความสุขส่วนตัวบางอย่าง """
p13_2="""ไพ่กลับหัวของ  The Hanged Man ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ หมายถึง การรอคอย เสียสละ เพื่อน ๆ อาจได้เจอกับสถานการณ์ที่ไม่อาจตัดสินใจทำอะไรได้ ต้องอยู่นิ่ง ๆ ต้องรอคอย หรืออาจจะต้องเสียสละความสุขส่วนตัวบางอย่าง"""


p14_1=""" Death  หมายถึง การเปลี่ยนแปลง เกิดใหม่ เรื่องร้าย ๆ จะกลายเป็นดีนะคะ สิ่งต่าง ๆ ที่ว่าร้ายแรงแล้วจะเริ่มเปลี่ยนแปลงไปในทางที่ดีขึ้นทีละนิด """
p14_2="""ไพ่กลับหัวของ Death ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ หมายถึง การเปลี่ยนแปลง เกิดใหม่ เรื่องร้าย ๆ จะกลายเป็นดีนะคะ สิ่งต่าง ๆ ที่ว่าร้ายแรงแล้วจะเริ่มเปลี่ยนแปลงไปในทางที่ดีขึ้นทีละนิด """


p15_1=""" Temperance  หมายถึง การต่อรอง ผสมผสาน สมดุล ไพ่อยากแนะนำให้เพื่อน ๆ สร้างความสมดุลให้ชีวิต ต้องต่อรองและยอมอ่อนข้อบ้างเพื่อให้ได้สิ่งที่ต้องการ """
p15_2="""ไพ่กลับหัวของ  Temperance ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ  หมายถึง การต่อรอง ผสมผสาน สมดุล ไพ่อยากแนะนำให้เพื่อน ๆ สร้างความสมดุลให้ชีวิต ต้องต่อรองและยอมอ่อนข้อบ้างเพื่อให้ได้สิ่งที่ต้องการ """


p16_1=""" The Devil  หมายถึง การควบคุม ผูกมัด ไร้ความหวัง ระวังให้ดี เมื่อไพ่ใบนี้ปรากฏขึ้นมา เพราะเพื่อน ๆ อาจเจอกับการควบคุม ถูกผูกมัดโดยไม่เต็มใจจนทำให้หมดพลังใจและหมดความหวัง  """
p16_2="""ไพ่กลับหัวของ The Devil ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ  หมายถึง การควบคุม ผูกมัด ไร้ความหวัง ระวังให้ดี เมื่อไพ่ใบนี้ปรากฏขึ้นมา เพราะเพื่อน ๆ อาจเจอกับการควบคุม ถูกผูกมัดโดยไม่เต็มใจจนทำให้หมดพลังใจและหมดความหวัง """


p17_1=""" The Tower หมายถึง การเปลี่ยนแปลงกะทันหัน การทะเลาะเบาะแว้ง ต้องเตรียมใจให้ดี เพราะอาจเจอเรื่องไม่คาดฝัน ได้รับข่าวสารที่ไม่ทันได้เตรียมใจ หรือเกิดเรื่องบาดหมางใหญ่โตกับคนรอบตัว   """
p17_2="""ไพ่กลับหัวของ The Tower ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ  หมายถึง การเปลี่ยนแปลงกะทันหัน การทะเลาะเบาะแว้ง ต้องเตรียมใจให้ดี เพราะอาจเจอเรื่องไม่คาดฝัน ได้รับข่าวสารที่ไม่ทันได้เตรียมใจ หรือเกิดเรื่องบาดหมางใหญ่โตกับคนรอบตัว  """


p18_1=""" The Star  หมายถึง ความหวัง ความสงบ แม้ฟ้าจะมืดมิด แต่หากไพ่ใบนี้โผล่ขึ้นมาก็เหมือนกับมีความหวังจากดวงดาวปรากฏขึ้น ควรทำตัวให้สงบเยือกเย็นเอาไว้ """
p18_2="""ไพ่กลับหัวของ  The Star ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ  หมายถึง ความหวัง ความสงบ แม้ฟ้าจะมืดมิด แต่หากไพ่ใบนี้โผล่ขึ้นมาก็เหมือนกับมีความหวังจากดวงดาวปรากฏขึ้น ควรทำตัวให้สงบเยือกเย็นเอาไว้ """


p19_1=""" The Moon หมายถึง ความกลัว ภาพลวงตา บางครั้งความกลัวก็อาจคืบคลานเข้ามาหาเพื่อน ๆ แบบไม่รู้ตัว แต่ไพ่อาจบอกให้พิจารณาให้ดีว่าสิ่งนั้นน่ากลัวจริง ๆ หรือเป็นเพียงภาพลวงตา """
p19_2="""ไพ่กลับหัวของ  The Moon ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ หมายถึง ความกลัว ภาพลวงตา บางครั้งความกลัวก็อาจคืบคลานเข้ามาหาเพื่อน ๆ แบบไม่รู้ตัว แต่ไพ่อาจบอกให้พิจารณาให้ดีว่าสิ่งนั้นน่ากลัวจริง ๆ หรือเป็นเพียงภาพลวงตา """


p20_1=""" The Sun  หมายถึง การเติบโต แสงสว่าง มีชีวิตชีวา ไพ่ที่เป็นตัวแทนของความร้อนแรงและสดใส และเร็ว ๆ นี้อาจมีเรื่องดี ๆ เข้ามาเซอร์ไพรส์ก็เป็นได้ """
p20_2="""ไพ่กลับหัวของ  The Sun ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ  หมายถึง การเติบโต แสงสว่าง มีชีวิตชีวา ไพ่ที่เป็นตัวแทนของความร้อนแรงและสดใส และเร็ว ๆ นี้อาจมีเรื่องดี ๆ เข้ามาเซอร์ไพรส์ก็เป็นได้ """


p21_1=""" Judgement หมายถึง การตัดสินใจ โอกาสครั้งที่สอง จะมีเรื่องสำคัญมาก ๆ เข้ามาให้ต้องตัดสินใจ ต้องปล่อยอดีตให้ผ่านไปเพื่อให้สิ่งใหม่ ๆ ได้เข้ามาแทน """
p21_2="""ไพ่กลับหัวของ  Judgement ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ หมายถึง การตัดสินใจ โอกาสครั้งที่สอง จะมีเรื่องสำคัญมาก ๆ เข้ามาให้ต้องตัดสินใจ ต้องปล่อยอดีตให้ผ่านไปเพื่อให้สิ่งใหม่ ๆ ได้เข้ามาแทน """


p22_1=""" The World  หมายถึง ความสำเร็จ ความสมบูรณ์ ถือเป็นอีกหนึ่งใบดี ๆ อีกหนึ่งใบ มีความสำเร็จเกิดขึ้น ชีวิตเติมเต็มมาก ๆ ด้วย """
p22_2="""ไพ่กลับหัวของ  The World ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ  หมายถึง ความสำเร็จ ความสมบูรณ์ ถือเป็นอีกหนึ่งใบดี ๆ อีกหนึ่งใบ มีความสำเร็จเกิดขึ้น ชีวิตเติมเต็มมาก ๆ ด้วย """

"--------------------------------------------------------------------------------------------------------------------------------------------------"
p23_1=""" ถ้วย 1  หมายถึง ความรัก การเริ่มต้น การมอบสิ่งดี ๆ ให้กับอีกฝ่ายหรืออาจจะเป็นฝ่ายได้รับสิ่งดี ๆ จากผู้อื่น """
p23_2="""ไพ่กลับหัวของ  ถ้วย 1 ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ หมายถึง ความรัก การเริ่มต้น การมอบสิ่งดี ๆ ให้กับอีกฝ่ายหรืออาจจะเป็นฝ่ายได้รับสิ่งดี ๆ จากผู้อื่น """


p24_1=""" ถ้วย 2 หมายถึง คนรัก คู่รัก การมอบความรักให้กันและกัน ถ้าชอบใครอยู่อาจมีโอกาสสมหวังนะคะ"""
p24_2="""ไพ่กลับหัวของ  ถ้วย 2 ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ หมายถึง คนรัก คู่รัก การมอบความรักให้กันและกัน ถ้าชอบใครอยู่อาจมีโอกาสสมหวังนะคะ"""


p25_1=""" ถ้วย 3   หมายถึง การเฉลิมฉลอง ปาร์ตี้กับเพื่อน ๆ มีความรักแบบเพื่อนฝูง แฮปปี้มีความสุข """
p25_2="""ไพ่กลับหัวของ ถ้วย 3 ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ  หมายถึง การเฉลิมฉลอง ปาร์ตี้กับเพื่อน ๆ มีความรักแบบเพื่อนฝูง แฮปปี้มีความสุข """


p26_1=""" ถ้วย 4  หมายถึง การหยุดนิ่ง ความเบื่อหน่าย แม้จะมีความสุข มีสิ่งดี ๆ รายล้อม แต่กลับเบื่อหน่ายเพราะอยู่แต่ในกรอบเดิม ๆ """
p26_2="""ไพ่กลับหัวของ ถ้วย 4  ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ  หมายถึง การหยุดนิ่ง ความเบื่อหน่าย แม้จะมีความสุข มีสิ่งดี ๆ รายล้อม แต่กลับเบื่อหน่ายเพราะอยู่แต่ในกรอบเดิม ๆ """


p27_1=""" ถ้วย 5  หมายถึง การสูญเสีย ความเศร้า เหมือนถ้วยที่ล้มลง ความรู้สึกสิ้นหวัง ความหวังพังทลาย"""
p27_2="""ไพ่กลับหัวของ ถ้วย 5  ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ  หมายถึง การสูญเสีย ความเศร้า เหมือนถ้วยที่ล้มลง ความรู้สึกสิ้นหวัง ความหวังพังทลาย"""


p28_1=""" ถ้วย 6   หมายถึง ความสงบสุข มีคนมาเยี่ยม อาจได้รับเซอร์ไพรส์จากคนอื่น มีการมาหาแบบไม่ทันตั้งตัว ได้รับของฝาก"""
p28_2="""ไพ่กลับหัวของ  ถ้วย 6 ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ  หมายถึง ความสงบสุข มีคนมาเยี่ยม อาจได้รับเซอร์ไพรส์จากคนอื่น มีการมาหาแบบไม่ทันตั้งตัว ได้รับของฝาก"""


p29_1=""" ถ้วย 7  หมายถึง ความสับสน ตัวเลือกเยอะ เกิดขึ้นได้จากความรู้สึกที่มีมากมายเกินความจำเป็น หรือแม้แต่มีข้อเสนอเข้ามาเยอะมากจนตัดสินใจไม่ถูก"""
p29_2="""ไพ่กลับหัวของ ถ้วย 7  ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ  หมายถึง ความสับสน ตัวเลือกเยอะ เกิดขึ้นได้จากความรู้สึกที่มีมากมายเกินความจำเป็น หรือแม้แต่มีข้อเสนอเข้ามาเยอะมากจนตัดสินใจไม่ถูก"""


p30_1=""" ถ้วย 8  หมายถึง การจากลา ทอดทิ้ง การเดินหนีจากสิ่งที่ทำให้ผิดหวัง หรือเรื่องนั้น ๆ ได้จบลงแล้ว ได้เวลาก้าวต่อไป"""
p30_2="""ไพ่กลับหัวของ ถ้วย 8 ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ  หมายถึง การจากลา ทอดทิ้ง การเดินหนีจากสิ่งที่ทำให้ผิดหวัง หรือเรื่องนั้น ๆ ได้จบลงแล้ว ได้เวลาก้าวต่อไป"""


p31_1=""" ถ้วย 9  หมายถึง สมหวัง ความหวังเป็นจริง สิ่งที่อยากได้กำลังจะกลายเป็นจริงแล้วนะคะ นั่งรอได้เลย"""
p31_2="""ไพ่กลับหัวของ ถ้วย 9  ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ  หมายถึง สมหวัง ความหวังเป็นจริง สิ่งที่อยากได้กำลังจะกลายเป็นจริงแล้วนะคะ นั่งรอได้เลย"""


p32_1=""" ถ้วย 10 หมายถึง ความสุข ครอบครัว การมีทุกอย่างพร้อม มีความสุขแบบสุด ๆ  """
p32_2="""ไพ่กลับหัวของ  ถ้วย 10 ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ  หมายถึง ความสุข ครอบครัว การมีทุกอย่างพร้อม มีความสุขแบบสุด ๆ """


p33_1=""" มหาดเล็กถ้วย  หมายถึง ความสนุก ชอบเข้าสังคม ได้พบเจอกับคนมากหน้าหลายตา หรืออาจได้รับข่าวสารบางอย่าง  """
p33_2="""ไพ่กลับหัวของ  มหาดเล็กถ้วย ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ  หมายถึง ความสนุก ชอบเข้าสังคม ได้พบเจอกับคนมากหน้าหลายตา หรืออาจได้รับข่าวสารบางอย่าง  """


p34_1=""" อัศวินถ้วย  หมายถึง นักสู้ นักฝัน การขอร้อง ขอแต่งงาน อยากได้สิ่งใดก็ต้องออกไปฝ่าฟันเอามาให้ได้ """
p34_2="""ไพ่กลับหัวของ  อัศวินถ้วย ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ  หมายถึง นักสู้ นักฝัน การขอร้อง ขอแต่งงาน อยากได้สิ่งใดก็ต้องออกไปฝ่าฟันเอามาให้ได้ """


p35_1=""" ราชินีถ้วย  หมายถึง สัญชาตญาณดี การพิจารณา หากต้องตัดสินใจอะไรก็ตาม ต้องคิดทบทวนอย่างรอบคอบ"""
p35_2="""ไพ่กลับหัวของ  ราชินีถ้วย ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ  หมายถึง สัญชาตญาณดี การพิจารณา หากต้องตัดสินใจอะไรก็ตาม ต้องคิดทบทวนอย่างรอบคอบ"""


p36_1=""" ราชาถ้วย  หมายถึง ฉลาด สุขุม อดทน แม้ว่าจะต้องเจอกับเหตุการณ์ไม่มั่นคงใด ๆ ก็ต้องวางตัวหนักแน่  ใช้เหตุผลมากกว่าอารมณ์ """
p36_2="""ไพ่กลับหัวของ  ราชาถ้วย ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ  หมายถึง ฉลาด สุขุม อดทน แม้ว่าจะต้องเจอกับเหตุการณ์ไม่มั่นคงใด ๆ ก็ต้องวางตัวหนักแน่  ใช้เหตุผลมากกว่าอารมณ์ """


p37_1=""" เหรียญ 1  หมายถึง เงินทอง ความสำเร็จ การเริ่มต้น จุดเริ่มต้นของความมั่นคงมาถึงแล้ว เตรียมรับให้ดี"""
p37_2="""ไพ่กลับหัวของ  เหรียญ 1 ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ  หมายถึง เงินทอง ความสำเร็จ การเริ่มต้น จุดเริ่มต้นของความมั่นคงมาถึงแล้ว เตรียมรับให้ดี"""


p38_1=""" เหรียญ 2 หมายถึง การตัดสินใจ การเลือกด้วยความระมัดระวัง และยังหมายถึงการหมุนเงินอีกด้วย """
p38_2="""ไพ่กลับหัวของ เหรียญ  2 ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ หมายถึง การตัดสินใจ การเลือกด้วยความระมัดระวัง และยังหมายถึงการหมุนเงินอีกด้วย """

p39_1=""" เหรียญ 3 หมายถึง การแสดงความสามารถออกมาให้คนอื่นเห็น การมุ่งมั่นสร้างฐานะ """
p39_2="""ไพ่กลับหัวของ เหรียญ  3 ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ หมายถึง การแสดงความสามารถออกมาให้คนอื่นเห็น การมุ่งมั่นสร้างฐานะ """

p40_1=""" เหรียญ 4 หมายถึง ความมั่นคง ความร่ำรวย เก็บเงินเก่งจนสร้างความมั่นคงให้ชีวิตได้ดี """
p40_2="""ไพ่กลับหัวของ เหรียญ 4 ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ หมายถึง ความมั่นคง ความร่ำรวย เก็บเงินเก่งจนสร้างความมั่นคงให้ชีวิตได้ดี """

p41_1=""" เหรียญ 5 หมายถึง มีปัญหาทางการเงิน การแยกจากกัน ความลำบาก ช่วยเหลือคนอื่นไม่ได้ และคนอื่นก็ไม่ได้ช่วยเหลือเช่นกัน"""
p41_2="""ไพ่กลับหัวของ เหรียญ  5 ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ หมายถึง มีปัญหาทางการเงิน การแยกจากกัน ความลำบาก ช่วยเหลือคนอื่นไม่ได้ และคนอื่นก็ไม่ได้ช่วยเหลือเช่นกัน"""

p42_1=""" เหรียญ 6  หมายถึง ความมีน้ำใจ การแบ่งปัน แต่ก็เป็นการแบ่งปันที่ไม่เท่าเทียม ฝ่ายใดฝ่ายหนึ่งได้มากกว่า"""
p42_2="""ไพ่กลับหัวของ เหรียญ  6 ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ  หมายถึง ความมีน้ำใจ การแบ่งปัน แต่ก็เป็นการแบ่งปันที่ไม่เท่าเทียม ฝ่ายใดฝ่ายหนึ่งได้มากกว่า"""

p43_1=""" เหรียญ 7 หมายถึง การลงทุน รางวัลตอบแทน ได้รับผลตอบแทนของการทำงานที่ผ่านมา"""
p43_2="""ไพ่กลับหัวของ เหรียญ  7 ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ หมายถึง การลงทุน รางวัลตอบแทน ได้รับผลตอบแทนของการทำงานที่ผ่านมา"""

p44_1=""" เหรียญ 8 หมายถึง ขยัน ทุ่มเท ขยันทำงานสร้างเงินทองและความมั่นคงของฐานะ ต้องทำงานถึงจะได้เงิน"""
p44_2="""ไพ่กลับหัวของ เหรียญ  8 ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ หมายถึง ขยัน ทุ่มเท ขยันทำงานสร้างเงินทองและความมั่นคงของฐานะ ต้องทำงานถึงจะได้เงิน"""

p45_1=""" เหรียญ 9  หมายถึง  มั่นคง มั่งคั่ง มีเงินเก็บมากมาย มีความสบายพร้อมทุกด้าน"""
p45_2="""ไพ่กลับหัวของ เหรียญ  9 ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ  หมายถึง  มั่นคง มั่งคั่ง มีเงินเก็บมากมาย มีความสบายพร้อมทุกด้าน"""

p46_1=""" เหรียญ 10 หมายถึง การแต่งงาน ได้รับมรดก ชีวิตดี ๆ ครอบครัวดี เงินดี ชีวิตที่พร้อมทุก ๆ ด้าน """
p46_2="""ไพ่กลับหัวของ เหรียญ  10 ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ หมายถึง การแต่งงาน ได้รับมรดก ชีวิตดี ๆ ครอบครัวดี เงินดี ชีวิตที่พร้อมทุก ๆ ด้าน """

p47_1=""" มหาดเล็กเหรียญ  หมายถึง ได้รับข้อเสนอ ได้รับโอกาสดี ๆ แม้จะเป็นเพียงการเริ่มต้นเล็ก ๆ ก็ตาม"""
p47_2="""ไพ่กลับหัวของ มหาดเล็กเหรียญ  ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ  หมายถึง ได้รับข้อเสนอ ได้รับโอกาสดี ๆ แม้จะเป็นเพียงการเริ่มต้นเล็ก ๆ ก็ตาม"""

p48_1=""" อัศวินเหรียญ หมายถึง ความละเอียด การใส่ใจ รักอิสระ กล้าออกไปหาเส้นทางใหม่ ๆ """
p48_2="""ไพ่กลับหัวของ  อัศวินเหรียญ ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ  หมายถึง ความละเอียด การใส่ใจ รักอิสระ กล้าออกไปหาเส้นทางใหม่ ๆ """

p49_1=""" ราชินีเหรียญ หมายถึง ใจกว้าง ความอุดมสมบูรณ์ การคิดพิจารณาอย่างละเอียดรอบคอบ"""
p49_2="""ไพ่กลับหัวของ  ราชินีเหรียญ ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ หมายถึง ใจกว้าง ความอุดมสมบูรณ์ การคิดพิจารณาอย่างละเอียดรอบคอบ """

p50_1="""ราชาเหรียญ  หมายถึง ประสบความสำเร็จ ร่ำรวย มีเงินทองมากมาย หวังสิ่งใดก็จะได้สิ่งนั้น ไม่ขัดสน ไม่ลำบาก """
p50_2="""ไพ่กลับหัวของ  ราชาเหรียญความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ   หมายถึง ประสบความสำเร็จ ร่ำรวย มีเงินทองมากมาย หวังสิ่งใดก็จะได้สิ่งนั้น ไม่ขัดสน ไม่ลำบาก """

p51_1=""" ดาบ 1 หมายถึง ความสำเร็จ จุดเริ่มต้นของสิ่งใหม่ ๆ มีคนยื่นโอกาสดี ๆ เข้ามาให้ """
p51_2="""ไพ่กลับหัวของ  ดาบ 1 ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ  หมายถึง ความสำเร็จ จุดเริ่มต้นของสิ่งใหม่ ๆ มีคนยื่นโอกาสดี ๆ เข้ามาให้ """

p52_1=""" ดาบ 2 หมายถึง การจนมุม ขยับตัวไม่ได้ เลือกไม่ได้ว่าต้องทำอย่างไร ตัดสินใจไม่ได้ """
p52_2="""ไพ่กลับหัวของ ดาบ 2 ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ  หมายถึง การจนมุม ขยับตัวไม่ได้ เลือกไม่ได้ว่าต้องทำอย่างไร ตัดสินใจไม่ได้ """

p53_1=""" ดาบ 3 หมายถึง ความเสียใจ ใจสลาย ต้องเจอเรื่องผิดหวัง และยังหมายถึงเจอฝนถล่มก็ได้ """
p53_2="""ไพ่กลับหัวของ  ดาบ 3ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ   หมายถึง ความเสียใจ ใจสลาย ต้องเจอเรื่องผิดหวัง และยังหมายถึงเจอฝนถล่มก็ได้ """

p54_1=""" ดาบ 4 หมายถึง การพักผ่อน นิ่งเฉย โดนกดดันจากรอบตัวจนไม่อาจตัดสินใจอะไรได้  """
p54_2="""ไพ่กลับหัวของ  ดาบ 4ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ หมายถึง การพักผ่อน นิ่งเฉย โดนกดดันจากรอบตัวจนไม่อาจตัดสินใจอะไรได้   """

p55_1=""" ดาบ 5หมายถึง ปัญหาต่าง ๆ ที่ถาโถมเข้ามา การไม่ลงรอยกันกับคนรอบตัว รวมไปถึงการสูญเสียบางสิ่งบางอย่าง  """
p55_2="""ไพ่กลับหัวของ  ดาบ 5ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ หมายถึง ปัญหาต่าง ๆ ที่ถาโถมเข้ามา การไม่ลงรอยกันกับคนรอบตัว รวมไปถึงการสูญเสียบางสิ่งบางอย่าง   """

p56_1=""" ดาบ 6 หมายถึง การละเลยปัญหา เพิกเฉยต่อปัญหา จนบานปลายและทำให้ตกอยู่ในสภาวะจำยอม หรือต้องปล่อยตัวเองไปตามน้ำ """
p56_2="""ไพ่กลับหัวของ  ดาบ 6ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ  หมายถึง การละเลยปัญหา เพิกเฉยต่อปัญหา จนบานปลายและทำให้ตกอยู่ในสภาวะจำยอม หรือต้องปล่อยตัวเองไปตามน้ำ """

p57_1=""" ดาบ 7หมายถึง การขโมย ทำเรื่องผิดกฎหมายต่าง ๆ รวมถึงงานที่มีเยอะมากจนล้นมือทำไม่ทัน """
p57_2="""ไพ่กลับหัวของ  ดาบ 7ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ  หมายถึง การขโมย ทำเรื่องผิดกฎหมายต่าง ๆ รวมถึงงานที่มีเยอะมากจนล้นมือทำไม่ทัน """

p58_1=""" ดาบ 8 หมายถึง การถูกบีบบังคับจากสถานการณ์ต่าง ๆ รอบตัวจนไม่อาจขยับตัวทำอะไรได้ หรือถูกปิดหูปิดตา"""
p58_2="""ไพ่กลับหัวของ ดาบ 8 ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ  หมายถึง การถูกบีบบังคับจากสถานการณ์ต่าง ๆ รอบตัวจนไม่อาจขยับตัวทำอะไรได้ หรือถูกปิดหูปิดตา"""

p59_1=""" ดาบ 9หมายถึง ความเครียด ความกังวล ปวดหัว คิดมาก รุนแรงถึงขั้นนอนไม่หลับ   """
p59_2="""ไพ่กลับหัวของ ดาบ 9 ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ หมายถึง ความเครียด ความกังวล ปวดหัว คิดมาก รุนแรงถึงขั้นนอนไม่หลับ   """

p60_1=""" ดาบ 10หมายถึง จุดจบ สิ้นสุด เรื่องเครียดและปวดหัวต่าง ๆ จะจบลงในไม่ช้า """
p60_2="""ไพ่กลับหัวของ  ดาบ 10ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ หมายถึง จุดจบ สิ้นสุด เรื่องเครียดและปวดหัวต่าง ๆ จะจบลงในไม่ช้า  """

p61_1=""" มหาดเล็กดาบ หมายถึง การใช้สัญชาตญาณในการตัดสินใจ เชื่อมั่นในตัวเอง และต้องอดทนเอาไว้แล้วจะชนะอุปสรรคต่าง ๆ ได้  """
p61_2="""ไพ่กลับหัวของ มหาดเล็กดาบ ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ   หมายถึง การใช้สัญชาตญาณในการตัดสินใจ เชื่อมั่นในตัวเอง และต้องอดทนเอาไว้แล้วจะชนะอุปสรรคต่าง ๆ ได้  """

p62_1="""อัศวินดาบ  หมายถึง การต่อสู้ ฝ่าฟัน ศัตรู ต้องออกแรงค่อนข้างเยอะ ต้องเหนื่อย ต้องสู้ แล้วถึงจะได้ในสิ่งที่ต้องการ """
p62_2="""ไพ่กลับหัวของ  อัศวินดาบความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ   หมายถึง การต่อสู้ ฝ่าฟัน ศัตรู ต้องออกแรงค่อนข้างเยอะ ต้องเหนื่อย ต้องสู้ แล้วถึงจะได้ในสิ่งที่ต้องการ """

p63_1=""" ราชินีดาบ หมายถึง ความอิสระเสรี ความตรงไปตรงมา ความเด็ดเดี่ยว จัดการสิ่งใดด้วยความเด็ดขาด ไม่ลังเล"""
p63_2="""ไพ่กลับหัวของ  ราชินีดาบ ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ หมายถึง ความอิสระเสรี ความตรงไปตรงมา ความเด็ดเดี่ยว จัดการสิ่งใดด้วยความเด็ดขาด ไม่ลังเล """

p64_1=""" ราชาดาบ หมายถึง ความมุ่งมั่น ความเด็ดเดี่ยว การคิดวิเคราะห์ หากเจออุปสรรคใด ๆ ต้องใช้ทั้ง 3 อย่างเพื่อผ่านไปให้ได้ """
p64_2="""ไพ่กลับหัวของ ราชาดาบ  ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ หมายถึง ความมุ่งมั่น ความเด็ดเดี่ยว การคิดวิเคราะห์ หากเจออุปสรรคใด ๆ ต้องใช้ทั้ง 3 อย่างเพื่อผ่านไปให้ได้  """

p65_1=""" ไม้เท้า 1หมายถึง การได้รับข่าวสาร ได้รับโอกาส หรือได้เริ่มต้นกิจกรรมบางอย่าง"""
p65_2="""ไพ่กลับหัวของ ไม้เท้า 1 ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ หมายถึง การได้รับข่าวสาร ได้รับโอกาส หรือได้เริ่มต้นกิจกรรมบางอย่าง """

p66_1="""ไม้เท้า 2 หมายถึง การวางแผนการต่าง ๆ ในอนาคต ความกล้าหาญ กล้าจะก้าวออกไปยังโลกอันไม่คุ้นเคย """
p66_2="""ไพ่กลับหัวของ  ไม้เท้า 2ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ  หมายถึง การวางแผนการต่าง ๆ ในอนาคต ความกล้าหาญ กล้าจะก้าวออกไปยังโลกอันไม่คุ้นเคย """

p67_1=""" ไม้เท้า 3 หมายถึง การเดินทางไปยังที่ที่ไม่คุ้นเคย ทำในสิ่งที่กลัว หรือการมองการณ์ไกล """
p67_2="""ไพ่กลับหัวของ ไม้เท้า 3 ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ  หมายถึง การเดินทางไปยังที่ที่ไม่คุ้นเคย ทำในสิ่งที่กลัว หรือการมองการณ์ไกล  """

p68_1=""" ไม้เท้า 4หมายถึง การเฉลิมฉลอง การแต่งงาน หรือความสุขสมหวัง"""
p68_2="""ไพ่กลับหัวของ ไม้เท้า 4 ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ  หมายถึง การเฉลิมฉลอง การแต่งงาน หรือความสุขสมหวัง"""

p69_1=""" ไม้เท้า 5 หมายถึง การแข่งขันกับคนหมู่มาก อุปสรรคเยอะมาก หรือทะเลาะเบาะแว้ง ไม่ลงรอยกัน """
p69_2="""ไพ่กลับหัวของ ไม้เท้า 5 ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ  หมายถึง การแข่งขันกับคนหมู่มาก อุปสรรคเยอะมาก หรือทะเลาะเบาะแว้ง ไม่ลงรอยกัน  """

p70_1=""" ไม้เท้า 6หมายถึง ชัยชนะ ความสำเร็จ การเฉลิมฉลองความสำเร็จ """
p70_2="""ไพ่กลับหัวของ  ไม้เท้า 6ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ หมายถึง ชัยชนะ ความสำเร็จ การเฉลิมฉลองความสำเร็จ  """

p71_1=""" ไม้เท้า 7 หมายถึง ความยึดมั่น การปกป้องตัวเอง อุปสรรคหรือภาระที่ถาโถมเข้ามาพร้อม ๆ กัน  """
p71_2="""ไพ่กลับหัวของ ไม้เท้า 7 ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ  หมายถึง ความยึดมั่น การปกป้องตัวเอง อุปสรรคหรือภาระที่ถาโถมเข้ามาพร้อม ๆ กัน   """

p72_1=""" ไม้เท้า 8 หมายถึง ข่าวสาร การติดต่อสื่อสารจากทางไกล หรือมีโอกาสได้เดินทางไกล """
p72_2="""ไพ่กลับหัวของ  ไม้เท้า 8ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ  หมายถึง ข่าวสาร การติดต่อสื่อสารจากทางไกล หรือมีโอกาสได้เดินทางไกล  """

p73_1="""ไม้เท้า 9  หมายถึง ความเข้มแข็งและมุ่งมั่น การตัดสินใจเลือกสิ่งสำคัญ การป้องกันตัวเอง """
p73_2="""ไพ่กลับหัวของ ไม้เท้า 9 ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ  หมายถึง ความเข้มแข็งและมุ่งมั่น การตัดสินใจเลือกสิ่งสำคัญ การป้องกันตัวเอง  """

p74_1=""" ไม้เท้า 10 หมายถึง ภาระหน้าที่หรือการทำงานมากเกินไปจนไม่สามารถขยับตัวไปทำสิ่งอื่น ๆ ได้ """
p74_2="""ไพ่กลับหัวของ ไม้เท้า 10 ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ   หมายถึง ภาระหน้าที่หรือการทำงานมากเกินไปจนไม่สามารถขยับตัวไปทำสิ่งอื่น ๆ ได้ """

p75_1=""" มหาดเล็กไม้เท้า"""
p75_2="""ไพ่กลับหัวของ มหาดเล็กไม้เท้า ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ  หมายถึง ได้รับข่าวสาร กระตือรือร้น กล้าหาญ มุ่งมั่นกับสิ่งที่เลือกแล้ว """

p76_1=""" อัศวินไม้เท้า หมายถึง มั่นใจในตัวเอง ชอบเสี่ยง การลงมือทำสิ่งต่าง ๆ ด้วยความรวดเร็วว่องไว """
p76_2="""ไพ่กลับหัวของ อัศวินไม้เท้า  ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ หมายถึง มั่นใจในตัวเอง ชอบเสี่ยง การลงมือทำสิ่งต่าง ๆ ด้วยความรวดเร็วว่องไว  """

p77_1="""ราชินีไม้เท้า หมายถึง การมีความคิดสร้างสรรค์ การเป็นตัวของตัวเอง  """
p77_2="""ไพ่กลับหัวของ ราชินีไม้เท้า  ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ หมายถึง การมีความคิดสร้างสรรค์ การเป็นตัวของตัวเอง  """

p78_1="""ราชาไม้เท้า หมายถึง การมีอำนาจ มีไอเดียใหม่ ๆ กล้าหาญ ความมั่นคงและน่าเชื่อถือ  """
p78_2="""ไพ่กลับหัวของ ราชาไม้เท้า  ความหมายจะตรงข้ามกับไพ่นี้ทั้งหมด โดยความหมายเดิมคือ  หมายถึง การมีอำนาจ มีไอเดียใหม่ ๆ กล้าหาญ ความมั่นคงและน่าเชื่อถือ """

CARD_MAP = {k: v for k, v in globals().items() if k.startswith("p") and isinstance(v, str)}



@app.get("/text/gemma3")
async def gemma(question:str):
  prompts = f"""
  คุณคือผู้เชี่ยวชาญด้านรถยนต์ อันนี้คือคําถามที่ผู้ใช้ถามมา "{question}"
  """
  exams = await call_gamma(user_input="จงตอบคําถามต่อไปนี้",prompt=prompts ,temperature=0.8)
  return PlainTextResponse(exams)

@app.get("/doo3")
async def doo3(content:str):
    card1=f"p{random.randint(1, 78)}_{random.randint(1, 2)}" 
    card2= f"p{random.randint(1, 78)}_{random.randint(1, 2)}"
    card3 = f"p{random.randint(1, 78)}_{random.randint(1, 2)}"

    info_card1 = CARD_MAP.get(card1, f"Unknown card: {card1}")
    info_card2 = CARD_MAP.get(card2, f"Unknown card: {card2}")
    info_card3 = CARD_MAP.get(card3, f"Unknown card: {card3}")
    prompts = f"""
    คุณคือผู้เชี่ยวชาญด้านการวิเคราะดวง โดยใช้ไพ่ยิปซี แบบ 3 ใบ อ่านแนวโน้มความสัมพันธ์ความรัก 
    หรือถามคำถามง่าย ๆ เช่น จะได้งานไหม จะได้โชคลาภหรือเปล่า
    ไพ่ Major Arcana ในการทำนายก็ได้เช่นกัน โดยไพ่สำรับนี้จะอ้างอิงตำนานต่าง ๆ และเน้นทำนายไปยังสถานการณ์ต่าง ๆ เป็นหลัก ไม่ได้เจาะจงเรื่องเงิน งาน ความรู้ หรือความเครียดเพียงเรื่องเดียว
    ไพ่ถ้วย (Cups) คือตัวแทนของความรู้สึกของผู้เปิดไพ่หรือผู้ที่ถูกถามถึง มีทั้งความหมายด้านดีและด้านลบ แบ่งเป็นทั้งหมด 14 ใบ 
    ไพ่เหรียญ (Pentacles) คือตัวแทนของเงินทองและความมั่งคั่ง ยิ่งเหรียญเยอะก็ยิ่งหมายถึงความร่ำรวย 
    ไพ่ดาบ (Swords) คือตัวแทนของความเครียด การฟันฝ่าอุปสรรค หากอยากประสบความสำเร็จก็ยิ่งต้องฝ่าฟัน ยิ่งต้องใช้ดาบเยอะเท่านั้น 
    ไพ่ไม้เท้า (Wands) คือตัวแทนของงาน ภาระหน้าที่ ความอดทน ยิ่งมีจำนวนไม้เท้ามากเท่าไรก็หมายถึงหน้าที่รับผิดชอบมากเท่านั้น รวมถึงต้องพยายามมากเท่านั้นด้วยเช่นกัน 
    
    โดยการตีความจะปรับตาม เรื่องของการดู 
    ใบแรกหมายถึง อดีต ปัจจุบัน อนาคต ใบสองหมายถึง ความรู้สึกเรา ความรู้สึกอีกฝ่าย  แนวโน้มในอนาคตแนวโน้มในอนาคต  ใบสามหมายถึง เหตุ ผล สรุป 
    รอบนี้คุณต้องดูเรื่อง "{content} และความหมายของไพ่ใบแรกคือ{info_card1} ความหมายของไพ่ใบสองคือ{info_card2} ความหมายของไพ่ใบสามคือ{info_card3}"
    """
    exams = await call_gamma(user_input="ดูดวงให้หน่อย ตอบแค่ฉันได้ไพ่อะไร แล้วสรุปแล้วดวงฉันเป็นอย่างไรบ้าง",prompt=prompts ,temperature=0.8)
    return PlainTextResponse(exams)

